[
  { "text": "The Firefox logo is not a fox. It's a Red Panda, which is also called a \"Firefox.\"" },
  { "text": "The first computer mouse, invented by Douglas Engelbart in 1964, was made of wood." },
  { "text": "The word \"robot\" comes from the Czech word \"robota,\" which means \"forced labor\" or \"drudgery.\"" },
  { "text": "The original name for Windows was \"Interface Manager.\" Bill Gates was convinced to change it." },
  { "text": "A group of scientists at Cambridge invented the first webcam in 1991 to monitor a coffee pot so they wouldn't waste a trip if it was empty." },
  { "text": "The name \"Google\" originated from a misspelling of the mathematical term \"googol\" (10^100)." },
  { "text": "Email was invented in 1971, which predates the World Wide Web (invented in 1989/1990)." },
  { "text": "The sound you hear when the original Xbox boots up contains snippets from actual NASA space missions." },
  { "text": "Nokia started as a paper mill, then made rubber boots, tires, and toilet paper before getting into electronics." },
  { "text": "The CAPS LOCK key is the most universally hated button in IT." },
  { "text": "The first 1GB hard drive in 1980 was the size of a refrigerator, weighed over 500 pounds, and cost $40,000." },
  { "text": "Your average keyboard contains 400 times more bacteria than a toilet seat. (Go clean your keyboard!)" },
  { "text": "The reason we call unrequested electronic messages \"Spam\" is due to a Monty Python sketch where a group of Vikings sing the word repeatedly." },
  { "text": "Every iPhone advertisement is set to the time 9:41 AM, the exact time Steve Jobs unveiled the first iPhone in 2007." },
  { "text": "Mark Zuckerberg is red-green colorblind, which is why blue dominates the Facebook color scheme." },
  { "text": "The longest word you can type using only the top row of a QWERTY keyboard is \"Typewriter.\"" },
  { "text": "The first commercial hard drive, the IBM 350 Disk File (1956), stored just 5 megabytes (MB) of data." },
  { "text": "The Internet is not the same as the World Wide Web; the Internet is the physical network, and the Web is the collection of pages and links (like an ocean vs. the ships on it)." },
  { "text": "The world's first programmer was a woman named Ada Lovelace in the mid-1800s." },
  { "text": "Domain name registration was free until 1995." },
  { "text": "NASA’s internal network runs at speeds 13,000 times faster than the average home internet connection." },
  { "text": "Google rents out goats to \"mow\" the lawns at their Mountain View headquarters." },
  { "text": "The world’s first-ever computer was the ENIAC, built in 1945, which weighed 27 tons and took up 1,800 square feet." },
  { "text": "Typing \"askew\" into a Google search bar will tilt the results page." },
  { "text": "The \"@\" symbol in email addresses was chosen by Ray Tomlinson because it was not common in names and would avoid confusion." },
  { "text": "The world’s most popular password for years has consistently been \"123456\" or \"password.\"" },
  { "text": "Samsung started in 1938 as a grocery store and noodle-making business." },
  { "text": "When using a computer, the average person blinks only 7 times per minute, compared to the normal rate of 20." },
  { "text": "The total weight of the entire Internet (the electrons in motion that make it work) has been estimated to be roughly the weight of a single strawberry (about 50 grams)." },
  { "text": "The first video uploaded to YouTube was titled \"Me at the Zoo\" on April 23, 2005." },
  { "text": "The first item sold on eBay was a broken laser pointer for $14.83. The buyer was a collector of broken laser pointers." },
  { "text": "The concept of a computer came long before electricity: Charles Babbage designed the mechanical Analytical Engine in the 1830s." },
  { "text": "Nintendo was founded in 1889, selling playing cards (Hanafuda)." },
  { "text": "The first computer virus, called \"Creeper\" (1971), was harmless and only displayed the message: \"I'M THE CREEPER: CATCH ME IF YOU CAN.\"" },
  { "text": "\"Voice.com\" is one of the most expensive domain names ever sold, going for $30 million in 2019." },
  { "text": "There are currently more connected devices (computers, phones, IoT gadgets) on Earth than there are people." },
  { "text": "A 75-year-old woman in Georgia once accidentally severed a fiber optic cable while scavenging for copper, cutting off internet to all of Armenia and parts of Georgia for hours." },
  { "text": "The founders of the biggest tech companies often have no college degree (Bill Gates, Steve Jobs, Mark Zuckerberg)." },
  { "text": "Ctrl+Alt+Del was originally intended to be a user-friendly feature by David Bradley, not a system-reset command." },
  { "text": "The first digital camera (1975) was the size of a toaster, took 23 seconds to record a photo, and the image was in black and white at 0.01 megapixels." },
  { "text": "The iconic Twitter bird logo is named \"Larry,\" after basketball legend Larry Bird." },
  { "text": "The Bluetooth logo is a combination of two Norse runes: H (for Harald) and B (for Bluetooth), representing Harald Bluetooth, a Danish king." },
  { "text": "The average life expectancy of a floppy disk is 3 to 5 years." },
  { "text": "MySpace accidentally deleted almost all music and photos uploaded to the site between 2003 and 2015 during a server migration." },
  { "text": "The first cell phone was a Motorola DynaTAC 8000x (1983). It weighed two pounds and cost nearly $4,000." },
  { "text": "The term \"Firewall\" comes from the physical barriers used to prevent a fire from spreading from one part of a building to another." },
  { "text": "A single Google search uses more computational power than the entire Apollo 11 moon mission had available." },
  { "text": "CAPTCHA stands for \"Completely Automated Public Turing test to tell Computers and Humans Apart.\"" },
  { "text": "Only about 8% of the world's currency is physical money; the rest is stored digitally." },
  { "text": "The biggest computer crash in history was the Y2K Bug... which was completely anticlimactic thanks to programmers working overtime." },
  { "text": "The first online order was a CD by the band Ten Summoner's Tales in 1994." },
  { "text": "The phrase \"You've Got Mail!\" was voiced by the husband of a programmer who worked on AOL." },
  { "text": "The smallest unit of memory that can store a piece of information is a bit (binary digit: 0 or 1)." },
  { "text": "The world’s first website, created by Tim Berners-Lee in 1991, is still online (info.cern.ch)." },
  { "text": "The programming language Python was named after the British comedy group Monty Python, not the snake." },
  { "text": "The earliest known analogue computer is the Antikythera mechanism, an ancient Greek device dating back to around 100 BC." },
  { "text": "Before founding Apple, Steve Jobs worked for Atari." },
  { "text": "The total number of mobile devices now exceeds the world's population." },
  { "text": "The official mascot for the BSD operating system is a smiling, waving cartoon devil named Beastie." },
  { "text": "The original purpose of YouTube was reportedly a video dating site called \"Tune In Hook Up.\"" },
  { "text": "The fear of computers is called logizomechanophobia." },
  { "text": "The average computer technician's diet consists mainly of caffeine, stale donuts, and the cold dread of an upcoming Monday." },
  { "text": "An average of 6,000 tweets are sent every second." },
  { "text": "The number of people who fall for a phishing scam is surprisingly high because the scammers only need to be right once." },
  { "text": "The first ever emoticon was proposed by Scott Fahlman in 1982: :-)" },
  { "text": "The original Apple logo featured Sir Isaac Newton sitting under a tree." },
  { "text": "Amazon was originally going to be named \"Cadabra\" (as in Abracadabra), but the name sounded too much like \"Cadaver\" over the phone." },
  { "text": "Linux was created by Linus Torvalds in 1991 as a hobby." },
  { "text": "The first recorded public broadcast on television was in 1925 and showed a rotating puppet." },
  { "text": "The computer game Tetris was the first video game to be exported from the Soviet Union to the US." },
  { "text": "Most IT professionals prefer to fix problems with a single, perfectly timed reboot." },
  { "text": "The programming language COBOL (Common Business-Oriented Language) is still used in many old banking and government systems." },
  { "text": "The first domain registered was symbolics.com on March 15, 1985." },
  { "text": "The computer's internal clock is often called the RTC (Real-Time Clock)." },
  { "text": "The term \"algorithm\" is named after the 9th-century Persian mathematician Muhammad ibn Musa al-Khwarizmi." },
  { "text": "The most popular search query on the Bing search engine is \"Google.\"" },
  { "text": "The first person to receive a computer-generated voice message was Queen Elizabeth II in 1976." },
  { "text": "The average lifespan of a modern computer fan is about 50,000 hours." },
  { "text": "The longest currently registered domain name is 63 characters long and belongs to a small village in Wales." },
  { "text": "Only about 5% of the internet's content is considered \"publicly indexable\" by search engines; the rest is the Deep Web." },
  { "text": "The \"refresh\" button on your browser is the technological equivalent of blowing on a video game cartridge." },
  { "text": "The technology that led to Wi-Fi was originally developed by an Australian astronomer to detect exploding black holes." },
  { "text": "The first computer game was Spacewar!, developed in 1962 by MIT students." },
  { "text": "The most common lie in IT is, \"I didn't change anything, it just stopped working!\"" },
  { "text": "The first piece of music ever played by a computer was \"God Save the Queen\" in 1951." },
  { "text": "The first image uploaded to the World Wide Web was a photo of a comedy band called Les Horribles Cernettes (created by CERN employees)." },
  { "text": "The IBM 5100 (1975) was a portable computer that weighed 55 pounds." },
  { "text": "The first-ever computer mouse only cost about $20 in parts to make." },
  { "text": "The person who invented the GIF pronounced it with a soft 'G' (Jif), like the peanut butter." },
  { "text": "Quantum computing uses qubits (q) which can be 0, 1, or both simultaneously (superposition)." },
  { "text": "The most difficult part of debugging is convincing yourself that the error is your fault." },
  { "text": "The term \"Trojan horse\" comes from the ancient Greek story of the siege of Troy." },
  { "text": "Bill Gates' first company, Traf-O-Data, failed." },
  { "text": "The first advertisement for a mobile phone was printed in a magazine in 1973." },
  { "text": "Despite all the progress in AI, you are still required to click on a tiny box to prove you are not a robot." },
  { "text": "The QWERTY keyboard layout was designed to slow down typists to prevent mechanical jamming." },
  { "text": "The first computer bug was an actual moth found trapped in a relay of the Harvard Mark II in 1947." },
  { "text": "DNS (Domain Name System) is often called the 'phonebook of the Internet'." }
  { "text": "The Apple I computer sold for $666.66 because Steve Wozniak liked repeating digits and found it easier to type." },
  { "text": "Java was originally named \"Oak\" after an oak tree that stood outside the office of its creator, James Gosling." },
  { "text": "The term \"Bug\" was used by Thomas Edison to describe technical glitches in 1878, nearly 70 years before the famous \"moth in the relay\" incident." },
  { "text": "Nintendo owns the rights to two Super Mario porn parodies (titled Super Hornio Brothers), which they bought solely to prevent them from being distributed." },
  { "text": "Space Invaders gets faster as you kill aliens because the original processor could finally render the remaining sprites faster as the load decreased." },
  { "text": "The \"Save\" icon (a floppy disk) is now recognized by younger generations only as the \"Save button,\" with many not knowing it depicts a physical object." },
  { "text": "Unix time begins on January 1, 1970 (the Epoch). If you see a date glitch to Dec 31, 1969, it's because the timestamp value is -1 or 0 (adjusted for time zones)." },
  { "text": "Hewlett-Packard (HP) was founded in a garage. In 1939, Bill Hewlett and Dave Packard flipped a coin to decide whether the company would be called Hewlett-Packard or Packard-Hewlett." },
  { "text": "Pixar started as the \"Computer Division\" of Lucasfilm before Steve Jobs bought it. Their primary product was originally a high-end computer called the Pixar Image Computer." },
  { "text": "The first banner ad appeared on Wired.com (then HotWired) in 1994 for AT&T. It had a 44% click-through rate." },
  { "text": "Microsoft saved Apple from bankruptcy in 1997 with a $150 million investment." },
  { "text": "The code for Apollo 11 was written by a team led by Margaret Hamilton. The printed stack of code stood nearly as tall as she did." },
  { "text": "The QR Code was invented by Denso Wave in 1994 to track automotive parts. Its design was inspired by the black and white pieces on a Go board." },
  { "text": "GPS relies on Einstein's Theory of Relativity. Without adjusting for the time dilation caused by the satellites' speed and gravity, GPS accuracy would drift by miles every day." },
  { "text": "Tim Berners-Lee apologized for the double slash (//) in URLs, admitting it was unnecessary and wasted paper/ink over the decades." },
  { "text": "C++ is named \"C plus plus\" because in programming, ++ is the operator to increment a value by 1. It is literally \"one better than C.\"" },
  { "text": "JavaScript was created in just 10 days by Brendan Eich." },
  { "text": "JavaScript is not related to Java. The name was a marketing ploy to piggyback on Java's popularity at the time." },
  { "text": "SQL was originally named SEQUEL (Structured English Query Language), but the name was changed due to a trademark dispute." },
  { "text": "There is a programming language called Whitespace that uses only spaces, tabs, and line breaks. The code looks like a blank page." },
  { "text": "There is a programming language called ArnoldC where all commands are one-liners from Arnold Schwarzenegger movies." },
  { "text": "GitHub's mascot is a \"octocat\"—a cat with five octopus legs (though commonly drawn with just the tail visible)." },
  { "text": "The \"Hello, World!\" tradition comes from the 1978 book The C Programming Language by Kernighan and Ritchie." },
  { "text": "HTML is technically a markup language, not a programming language, as it structures text but lacks logic like loops or variables." },
  { "text": "Perl is often nicknamed \"The Swiss Army Chainsaw\" of scripting languages." },
  { "text": "Scratch, the kids' coding language, was developed by MIT Media Lab." },
  { "text": "null (the concept of a null reference) was called a \"billion-dollar mistake\" by its inventor, Tony Hoare, due to the number of system crashes it has caused." },
  { "text": "Vim vs. Emacs is one of the oldest rivalries in computing, often referred to as the \"Editor War.\"" },
  { "text": "PHP originally stood for \"Personal Home Page\". It now stands for \"PHP: Hypertext Preprocessor\" (a recursive acronym)." },
  { "text": "The Konami Code (Up, Up, Down, Down, Left, Right, Left, Right, B, A) works on many websites, including some banks and Buzzfeed, often triggering Easter eggs." },
  { "text": "Moore's Law is not a law of physics; it is an observation that the number of transistors on a microchip doubles about every two years." },
  { "text": "The gold in electronic waste (e-waste) is more concentrated than in high-grade gold ore from a mine." },
  { "text": "Hard drives have a filtered air intake hole. If you cover it, the drive will eventually fail because the read/write head relies on air pressure to float above the disk." },
  { "text": "USB was designed to be non-reversible because making it reversible would have doubled the cost, which the inventors feared would kill the technology's adoption." },
  { "text": "The Raspberry Pi was originally intended to sell only 1,000 units to help students learn coding. It has now sold over 40 million units." },
  { "text": "The US Air Force once built a supercomputer out of 1,760 PlayStation 3 consoles because it was cheaper than buying standard server parts." },
  { "text": "A Zip Bomb is a malicious file that is small (kilobytes) when compressed but expands to petabytes when unzipped, crashing the system." },
  { "text": "The Intel 4004 (1971) was the first commercially available microprocessor." },
  { "text": "Modern CPUs are made of silicon, which is extracted from common sand." },
  { "text": "Water cooling computers involves using distilled water mixed with biocides to prevent algae growth inside your PC." },
  { "text": "Mechanical keyboards are preferred by gamers and typists because each key has an individual physical switch, offering tactile feedback." },
  { "text": "OLED screens can suffer from \"burn-in,\" where a static image (like a news ticker or health bar) remains permanently visible as a ghost image." },
  { "text": "The noise a dial-up modem made was actually the sound of the two computers \"handshaking\"—negotiating protocols and speeds." },
  { "text": "A Faraday Cage can block all wireless signals. Some secure government rooms are built as Faraday cages to prevent eavesdropping." },
  { "text": "The 404 Error was not named after \"Room 404\" at CERN. It simply follows the HTTP error code numbering scheme." },
  { "text": "Kevin Mitnick, once the world's most wanted hacker, served 5 years in prison and later became a highly paid security consultant." },
  { "text": "\"Phreaking\" was the precursor to hacking, involving the manipulation of phone systems to get free calls (often using a whistle found in Cap'n Crunch cereal boxes)." },
  { "text": "Wiki is a Hawaiian word meaning \"quick.\"" },
  { "text": "The first SMS ever sent was \"Merry Christmas\" in 1992." },
  { "text": "Cloudflare uses a wall of lava lamps in their San Francisco office to generate random numbers for encryption." },
  { "text": "Amazon owned a patent for \"1-Click\" buying until 2017. Apple licensed this patent from Amazon for use in iTunes." },
  { "text": "Incognito Mode does not hide your browsing history from your ISP or your employer; it only prevents your browser from saving the history locally." },
  { "text": "The \"Dark Web\" requires special software like Tor to access, whereas the \"Deep Web\" is simply anything not indexed by Google (like private emails)." },
  { "text": "Stuxnet was a computer worm discovered in 2010 that physically destroyed nuclear centrifuges in Iran by spinning them out of control." },
  { "text": "\"Salt\" in cryptography is random data added to a password before hashing it, ensuring that two users with the same password have different hashes." },
  { "text": "SQL Injection is a common hacking technique where an attacker types code into a login field to trick the database into granting access." },
  { "text": "DDOS stands for \"Distributed Denial of Service,\" working like a traffic jam where thousands of requests crash a website." },
  { "text": "VPN stands for Virtual Private Network." },
  { "text": "Tor stands for \"The Onion Router,\" named because it has layers of encryption like an onion." },
  { "text": "Google pays Mozilla (Firefox) hundreds of millions of dollars a year to remain the default search engine in the Firefox browser." },
  { "text": "Steve Jobs famously denied that he was the father of his daughter, Lisa, for years, yet named an early Apple computer the Apple Lisa." },
  { "text": "Netflix accounts for approximately 15% of the total downstream volume of traffic across the entire internet globally." },
  { "text": "Tesla cars run on a custom Linux-based operating system." },
  { "text": "Jeff Bezos originally wanted to name Amazon \"Relentless.\" If you type relentless.com into your browser, it still redirects to Amazon." },
  { "text": "The Twitter fail whale was originally an illustration of a peaceful whale being lifted by birds." },
  { "text": "Apple’s terms and conditions prohibit you from using their products to create nuclear missiles or biological weapons." },
  { "text": "Mark Zuckerberg has a tape over his laptop's webcam and microphone jack, as seen in a background photo posted on Facebook." },
  { "text": "Android versions were named alphabetically after desserts (Cupcake, Donut, Eclair...) until Android 10 broke the tradition." },
  { "text": "Steve Wozniak is still technically an employee of Apple and receives a stipend, despite not having an active role for decades." },
  { "text": "Bill Gates has been known to wash his own dishes every night, finding it meditative." },
  { "text": "Elon Musk bought x.com in 1999, sold it to PayPal, and bought it back in 2017 for \"sentimental value\" before using it for Twitter." },
  { "text": "The Google Doodles started when Larry Page and Sergey Brin drew a stick figure behind the logo to indicate they were at the Burning Man festival." },
  { "text": "Samsung manufactures the screens used in many iPhones. Apple and Samsung are both partners and rivals." },
  { "text": "The Corrupted Blood incident in World of Warcraft (2005) was a virtual pandemic that epidemiologists studied to understand real-world disease spread." },
  { "text": "In the original Super Mario Bros., the clouds and the bushes use the exact same sprite; only the color palette is different." },
  { "text": "The Pac-Man \"Kill Screen\" happens at level 256 because the 8-bit integer used to count levels overflows." },
  { "text": "Doom (1993) has been ported to run on pregnancy tests, ATMs, thermostats, and even inside the game Minecraft." },
  { "text": "Unreal Engine, now used for filmmaking (like The Mandalorian), was originally built just for the game Unreal in 1998." },
  { "text": "Minecraft is the best-selling video game of all time." },
  { "text": "Steam was created by Valve because they wanted a way to automatically update their games like Counter-Strike." },
  { "text": "The highest possible score in Snake (the Nokia version) involves filling the entire screen, at which point the game ends." },
  { "text": "Speedrunners utilize glitches like \"wall clipping\" to beat games in minutes that usually take hours." },
  { "text": "The term \"AFK\" (Away From Keyboard) originated in the chat rooms of the 1990s." },
  { "text": "Rubber Duck Debugging is a method where a programmer explains their code line-by-line to a rubber duck to find errors." },
  { "text": "The Year 2038 Problem is the next \"Y2K,\" where 32-bit systems will run out of seconds to count from 1970." },
  { "text": "The Command key (⌘) on Mac keyboards is a \"Place of Interest\" symbol used on road signs in Sweden and other Nordic countries." },
  { "text": "The Power symbol is a stylized combination of the binary \"1\" (on) and \"0\" (off)." },
  { "text": "A \"Nibble\" is half a byte (4 bits)." },
  { "text": "The ISO 8601 standard is the internationally accepted way to write dates (YYYY-MM-DD) to avoid confusion between formats." },
  { "text": "Ctrl+C and Ctrl+V (Cut and Paste) were popularized by Larry Tesler at Apple/Xerox PARC." },
  { "text": "Copy-pasting from Stack Overflow is such a common developer habit that on April Fool's Day, the site once added a limit to how many times you could copy code." },
  { "text": "Comic Sans is recommended for dyslexic readers because the irregular letter shapes make them easier to distinguish." },
  { "text": "Lorem Ipsum text is scrambled Latin from a passage by Cicero written in 45 BC." },
  { "text": "Bluetooth devices are named \"Master\" and \"Slave\" in the technical protocol, though the industry is moving toward \"Central\" and \"Peripheral.\"" },
  { "text": "Deep Blue was the first computer to defeat a reigning world chess champion (Garry Kasparov) in 1997." },
  { "text": "Watson, an IBM computer, defeated the two greatest Jeopardy! champions in 2011." },
  { "text": "AlphaGo defeated Lee Sedol at Go in 2016, a feat AI experts thought was still a decade away due to the game's complexity." },
  { "text": "Imposter Syndrome is reportedly higher in the tech industry than almost any other field due to the rapid pace of change." }
]
