[
  { "text": "The Firefox logo is not a fox. It's a Red Panda, which is also called a \"Firefox.\"" },
  { "text": "The first computer mouse, invented by Douglas Engelbart in 1964, was made of wood." },
  { "text": "The word \"robot\" comes from the Czech word \"robota,\" which means \"forced labor\" or \"drudgery.\"" },
  { "text": "The original name for Windows was \"Interface Manager.\" Bill Gates was convinced to change it." },
  { "text": "A group of scientists at Cambridge invented the first webcam in 1991 to monitor a coffee pot so they wouldn't waste a trip if it was empty." },
  { "text": "The name \"Google\" originated from a misspelling of the mathematical term \"googol\" (10^100)." },
  { "text": "Email was invented in 1971, which predates the World Wide Web (invented in 1989/1990)." },
  { "text": "The sound you hear when the original Xbox boots up contains snippets from actual NASA space missions." },
  { "text": "Nokia started as a paper mill, then made rubber boots, tires, and toilet paper before getting into electronics." },
  { "text": "The CAPS LOCK key is the most universally hated button in IT." },
  { "text": "The first 1GB hard drive in 1980 was the size of a refrigerator, weighed over 500 pounds, and cost $40,000." },
  { "text": "Your average keyboard contains 400 times more bacteria than a toilet seat. (Go clean your keyboard!)" },
  { "text": "The reason we call unrequested electronic messages \"Spam\" is due to a Monty Python sketch where a group of Vikings sing the word repeatedly." },
  { "text": "Every iPhone advertisement is set to the time 9:41 AM, the exact time Steve Jobs unveiled the first iPhone in 2007." },
  { "text": "Mark Zuckerberg is red-green colorblind, which is why blue dominates the Facebook color scheme." },
  { "text": "The longest word you can type using only the top row of a QWERTY keyboard is \"Typewriter.\"" },
  { "text": "The first commercial hard drive, the IBM 350 Disk File (1956), stored just 5 megabytes (MB) of data." },
  { "text": "The Internet is not the same as the World Wide Web; the Internet is the physical network, and the Web is the collection of pages and links (like an ocean vs. the ships on it)." },
  { "text": "The world's first programmer was a woman named Ada Lovelace in the mid-1800s." },
  { "text": "Domain name registration was free until 1995." },
  { "text": "NASA’s internal network runs at speeds 13,000 times faster than the average home internet connection." },
  { "text": "Google rents out goats to \"mow\" the lawns at their Mountain View headquarters." },
  { "text": "The world’s first-ever computer was the ENIAC, built in 1945, which weighed 27 tons and took up 1,800 square feet." },
  { "text": "Typing \"askew\" into a Google search bar will tilt the results page." },
  { "text": "The \"@\" symbol in email addresses was chosen by Ray Tomlinson because it was not common in names and would avoid confusion." },
  { "text": "The world’s most popular password for years has consistently been \"123456\" or \"password.\"" },
  { "text": "Samsung started in 1938 as a grocery store and noodle-making business." },
  { "text": "When using a computer, the average person blinks only 7 times per minute, compared to the normal rate of 20." },
  { "text": "The total weight of the entire Internet (the electrons in motion that make it work) has been estimated to be roughly the weight of a single strawberry (about 50 grams)." },
  { "text": "The first video uploaded to YouTube was titled \"Me at the Zoo\" on April 23, 2005." },
  { "text": "The first item sold on eBay was a broken laser pointer for $14.83. The buyer was a collector of broken laser pointers." },
  { "text": "The concept of a computer came long before electricity: Charles Babbage designed the mechanical Analytical Engine in the 1830s." },
  { "text": "Nintendo was founded in 1889, selling playing cards (Hanafuda)." },
  { "text": "The first computer virus, called \"Creeper\" (1971), was harmless and only displayed the message: \"I'M THE CREEPER: CATCH ME IF YOU CAN.\"" },
  { "text": "\"Voice.com\" is one of the most expensive domain names ever sold, going for $30 million in 2019." },
  { "text": "There are currently more connected devices (computers, phones, IoT gadgets) on Earth than there are people." },
  { "text": "A 75-year-old woman in Georgia once accidentally severed a fiber optic cable while scavenging for copper, cutting off internet to all of Armenia and parts of Georgia for hours." },
  { "text": "The founders of the biggest tech companies often have no college degree (Bill Gates, Steve Jobs, Mark Zuckerberg)." },
  { "text": "Ctrl+Alt+Del was originally intended to be a user-friendly feature by David Bradley, not a system-reset command." },
  { "text": "The first digital camera (1975) was the size of a toaster, took 23 seconds to record a photo, and the image was in black and white at 0.01 megapixels." },
  { "text": "The iconic Twitter bird logo is named \"Larry,\" after basketball legend Larry Bird." },
  { "text": "The Bluetooth logo is a combination of two Norse runes: H (for Harald) and B (for Bluetooth), representing Harald Bluetooth, a Danish king." },
  { "text": "The first version of the Dwarf Fortress game was written in the programming language BASIC." },
  { "text": "The average life expectancy of a floppy disk is 3 to 5 years." },
  { "text": "MySpace accidentally deleted almost all music and photos uploaded to the site between 2003 and 2015 during a server migration." },
  { "text": "The first cell phone was a Motorola DynaTAC 8000x (1983). It weighed two pounds and cost nearly $4,000." },
  { "text": "The term \"Firewall\" comes from the physical barriers used to prevent a fire from spreading from one part of a building to another." },
  { "text": "A single Google search uses more computational power than the entire Apollo 11 moon mission had available." },
  { "text": "CAPTCHA stands for \"Completely Automated Public Turing test to tell Computers and Humans Apart.\"" },
  { "text": "Only about 8% of the world's currency is physical money; the rest is stored digitally." },
  { "text": "The biggest computer crash in history was the Y2K Bug... which was completely anticlimactic thanks to programmers working overtime." },
  { "text": "The first online order was a CD by the band Ten Summoner's Tales in 1994." },
  { "text": "The phrase \"You've Got Mail!\" was voiced by the husband of a programmer who worked on AOL." },
  { "text": "The smallest unit of memory that can store a piece of information is a bit (binary digit: 0 or 1)." },
  { "text": "The world’s first website, created by Tim Berners-Lee in 1991, is still online (info.cern.ch)." },
  { "text": "The programming language Python was named after the British comedy group Monty Python, not the snake." },
  { "text": "The earliest known analogue computer is the Antikythera mechanism, an ancient Greek device dating back to around 100 BC." },
  { "text": "Before founding Apple, Steve Jobs worked for Atari." },
  { "text": "The total number of mobile devices now exceeds the world's population." },
  { "text": "The official mascot for the BSD operating system is a smiling, waving cartoon devil named Beastie." },
  { "text": "The original purpose of YouTube was reportedly a video dating site called \"Tune In Hook Up.\"" },
  { "text": "In a classic tech move, when setting up his dorm room, Linus Torvalds rigged a device to detect if the lab's coffee machine was done brewing, without having to leave his desk." },
  { "text": "The fear of computers is called logizomechanophobia." },
  { "text": "The average computer technician's diet consists mainly of caffeine, stale donuts, and the cold dread of an upcoming Monday." },
  { "text": "An average of 6,000 tweets are sent every second." },
  { "text": "The number of people who fall for a phishing scam is surprisingly high because the scammers only need to be right once." },
  { "text": "The first ever emoticon was proposed by Scott Fahlman in 1982: :-)" },
  { "text": "The original Apple logo featured Sir Isaac Newton sitting under a tree." },
  { "text": "Amazon was originally going to be named \"Cadabra\" (as in Abracadabra), but the name sounded too much like \"Cadaver\" over the phone." },
  { "text": "Linux was created by Linus Torvalds in 1991 as a hobby." },
  { "text": "The first recorded public broadcast on television was in 1925 and showed a rotating puppet." },
  { "text": "The computer game Tetris was the first video game to be exported from the Soviet Union to the US." },
  { "text": "Most IT professionals prefer to fix problems with a single, perfectly timed reboot." },
  { "text": "The programming language COBOL (Common Business-Oriented Language) is still used in many old banking and government systems." },
  { "text": "The first domain registered was symbolics.com on March 15, 1985." },
  { "text": "In 2013, over $12 million was lost in a Bitcoin scam, all due to a single spelling mistake in the code." },
  { "text": "The computer's internal clock is often called the RTC (Real-Time Clock)." },
  { "text": "The term \"algorithm\" is named after the 9th-century Persian mathematician Muhammad ibn Musa al-Khwarizmi." },
  { "text": "The most popular search query on the Bing search engine is \"Google.\"" },
  { "text": "The first person to receive a computer-generated voice message was Queen Elizabeth II in 1976." },
  { "text": "The average lifespan of a modern computer fan is about 50,000 hours." },
  { "text": "A Dreadnought is a type of attack that bypasses network firewalls (like the famous battleship bypassing enemy defenses)." },
  { "text": "The longest currently registered domain name is 63 characters long and belongs to a small village in Wales." },
  { "text": "Only about 5% of the internet's content is considered \"publicly indexable\" by search engines; the rest is the Deep Web." },
  { "text": "The \"refresh\" button on your browser is the technological equivalent of blowing on a video game cartridge." },
  { "text": "The technology that led to Wi-Fi was originally developed by an Australian astronomer to detect exploding black holes." },
  { "text": "The first computer game was Spacewar!, developed in 1962 by MIT students." },
  { "text": "The most common lie in IT is, \"I didn't change anything, it just stopped working!\"" },
  { "text": "The first piece of music ever played by a computer was \"God Save the Queen\" in 1951." },
  { "text": "A BitTorrent is named after a swarming insect, fitting its decentralized nature." },
  { "text": "The first image uploaded to the World Wide Web was a photo of a comedy band called Les Horribles Cernettes (created by CERN employees)." },
  { "text": "The IBM 5100 (1975) was a portable computer that weighed 55 pounds." },
  { "text": "The first-ever computer mouse only cost about $20 in parts to make." },
  { "text": "The person who invented the GIF pronounced it with a soft 'G' (Jif), like the peanut butter." },
  { "text": "Quantum computing uses qubits (q) which can be 0, 1, or both simultaneously (superposition)." },
  { "text": "The most difficult part of debugging is convincing yourself that the error is your fault." },
  { "text": "The term \"Trojan horse\" comes from the ancient Greek story of the siege of Troy." },
  { "text": "Bill Gates' first company, Traf-O-Data, failed." },
  { "text": "The first advertisement for a mobile phone was printed in a magazine in 1973." },
  { "text": "Despite all the progress in AI, you are still required to click on a tiny box to prove you are not a robot." },
  { "text": "The QWERTY keyboard layout was designed to slow down typists to prevent mechanical jamming." },
  { "text": "The first computer bug was an actual moth found trapped in a relay of the Harvard Mark II in 1947." },
  { "text": "DNS (Domain Name System) is often called the 'phonebook of the Internet'." }
]
